## Staging: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_glue_catalog_database.platform_gc_design_system` |
|        | `aws_glue_crawler.platform_gc_design_system_airtable` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.platform_gc_design_system will be created
  + resource "aws_glue_catalog_database" "platform_gc_design_system" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/gc-design-system/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_design_system"
      + region       = "ca-central-1"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.platform_gc_design_system_airtable will be created
  + resource "aws_glue_crawler" "platform_gc_design_system_airtable" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                  + Tables     = {
                      + AddOrUpdateBehavior = "MergeNewColumns"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name          = "platform_gc_design_system"
      + description            = "Classify the GC Design System Airtable export data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Design System / Airtable"
      + region                 = "ca-central-1"
      + role                   = "arn:aws:iam::454671348950:role/service-role/AWSGlueCrawler-DataLake"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_design_system_"
      + tags                   = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-transformed-staging/platform/gc-design-system/airtable/"
        }

      + schema_change_policy {
          + delete_behavior = "DELETE_FROM_DATABASE"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + platform_gc_design_system_crawler_arn  = (known after apply)
  + platform_gc_design_system_crawler_name = "Platform / GC Design System / Airtable"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_design_system"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_design_system_airtable"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
